#!/usr/bin/env python
# -*- coding: utf-8 -*-

# Tests the ngram models.
import codecs
import glob
import math
import pickle
import sys

import ngram
from ngram import ngramModel

class Sample(object):
  # A place where sample information is found
  def __init__(self, lang, font, note=None, string=None, fileName=None):
    self.text = string
    self.lang = lang
    self.font = font
    self.note = note
    self.fileName = fileName

def setSampleTexts(sampleTexts):
  sampleTexts.append(
    Sample('burmese', 'zawgyi', note='Zawgyi text from http://burmese.voanews.com/',
      string=u"""
      ရခိုင္ျပည္နယ္အၾကံေပးေကာ္မရွင္မွာ ႏုိင္ငံတကာပုဂၢိဳလ္ေတြပါေနလို႔ ႏုိင္ငံ
      အခ်ဳပ္အျခာအာဏာထိခိုက္မယ္ဆိုတဲ့ စိုးရိမ္မႈေတြကို ႏို္င္ငံေတာ္
      အတုိင္ပင္ခံပုဂၢိဳလ္ေဒၚေအာင္ဆန္းစုၾကည္က ပယ္ခ်လုိက္ပါတယ္။
      ရခိုင္ျပည္တြင္းေရးကို ႏုိင္ငံတကာအေရးျဖစ္ေအာင္ လုပ္ေဆာင္မယ္ဆိုတဲ့
      စြပ္စြဲခ်က္ေျပာဆိုခ်က္ေတြနဲ႔ပတ္သက္လို႔ အၾကံေပးေကာ္မရွင္ဥကၠ႒ ကုလအတြင္းေရးမွဴးခ်ဳပ္ေဟာင္း
       ကိုဖီအာနန္နဲ႔ ရန္ကုန္မွာ ျပဳလုပ္တဲ့ ပူးတြဲသတင္းစာရွင္းလင္းပြဲမွာ ေဒၚေအာင္ဆန္းစုၾကည္က
        အခုလိုေျပာဆိုရွင္းလင္းလုိက္တာပါ။ အသစ္ျပန္လည္ဖြဲ႔
      """
    )
  )
  sampleTexts.append(
    Sample('burmese', 'unicode', note='Burmese Unicode from http://www.bbc.com/burmese',
      string=u"""ရခိုင်ပြည်နယ်အကြံပေးကော်မရှင်မှာ နိုင်ငံတကာပုဂ္ဂိုလ်တွေပါနေလို့
      နိုင်ငံအချုပ်အခြာအာဏာထိခိုက်မယ်ဆိုတဲ့ စိုးရိမ်မှုတွေကို နိုင်ငံတော် အတိုင်ပင်ခံပုဂ္ဂိုလ်ဒေါ်အောင်ဆန်းစုကြည်က
      ပယ်ချလိုက်ပါတယ်။ ရခိုင်ပြည်တွင်းရေးကို နိုင်ငံတကာအရေးဖြစ်အောင် လုပ်ဆောင်မယ်ဆိုတဲ့
      စွပ်စွဲချက်ပြောဆိုချက်တွေနဲ့ပတ်သက်လို့ အကြံပေးကော်မရှင်ဥက္ကဋ္ဌ ကုလအတွင်းရေးမှူးချုပ်ဟောင်း
      ကိုဖီအာနန်နဲ့ ရန်ကုန်မှာ ပြုလုပ်တဲ့ ပူးတွဲသတင်းစာရှင်းလင်းပွဲမှာ ဒေါ်အောင်ဆန်းစုကြည်က
      အခုလိုပြောဆိုရှင်းလင်းလိုက်တာပါ။ အသစ်ပြန်လည်ဖွဲ့
      """
    )
  )
  sampleTexts.append(
    Sample('mon', 'mon', note='Mon font encoded from ...', 
      string=u"""လိက္အုပ္ နာဲပါန္သာ ခ်ဴ “ဝင္ခ်႘ဒရာင္ ပေရင္ဍဳင္ကြာန္မန္” တိတ္ေရာင္
        ကဵဝဵ၊ နဝ္ေဝမ္ဗာ ၁၅၊ ၂၀၁၃။ ကႜိဳပ္သကိုပ္ပၜန္ဂတးမန္ နာဲပါန္သာ မခ်ဴခှံလဝ္
        လိက္မှဳံယဿဳ “ဝင္ခ်႘ဒရာင္ ပေရင္ဍဳင္ကြာန္မန္” ဂွ္ ပေကာံပေကဝ္ တက္ပတိတ္မံင္တုဲ
        ကၜာသှာံဏံ ဟြံအိုတ္ကႜင္ဂွ္ ၾတးဏာ အလုံကဿိန္ဍဳင္မြဲေရာင္ဂွ္ နာဲသုန္ဓန္
        ညးမဒွ္ေကာန္စဵ နာဲပါန္သာ ဟုီရ။.... ေဗာ္ကဿိန္ဍဳင္ပံင္ေကာံ ဖက္ဒေရဝ္ ဂြံအေခါင္
        ဒက္ပတန္ေဗာ္ ကဵဝဵ၊ အံက္တဝ္ဗာ ၃၁၊ ၂၀၁၃။ ေဗာ္ကဿိန္ဍဳင္ပံင္ေကာံ ဖက္ဒေရဝ္
        (Federal Union Party- FUP) မဒွ္ေဗာ္ေကာန္ဍဳင္အရင္ဂမၜိဳင္ ပံင္ေကာံဒက္ပၲန္လဝ္ဂွ္
        ပႜဲဂိတုအံက္တဝ္ဗာ ၂၈ ဏံ ဂြံအေခါင္ဒက္ပတန္ေဗာ္ ႏူကဝ္မေယွန္ ေပဲါရုဲမာဲ ကဿိန္ဍဳင္ေရာင္
         ဂြံတီေကတ္ရ ႏူညးဒက္ပတန္ေဗာ္တံရ။....
         """
    )
  )
  sampleTexts.append(
    Sample('mon', 'unicode', note='Mon data from burmese.monnews.org', 
      string=u"""ေးသားသူ: နိုင်တိကချင်ပြည်နယ်က မိုင်ဂျာယန်ဆိုတဲ့မြို့ကလေးမှာ ဂျူလိုင်လကုန်ပိုင်းလောက်က ကျင်းပခဲ့တဲ့
      “တိုင်းရင်းသား လက်နက်ကိုင်တော်လှန်ရေး အဖွဲ့အစည်းများ၏ မျက်နှာစုံညီအစည်းအဝေး” ရဲ့ ဆုံးဖြတ်ချက်တွေ က
      ေငြာချက် တွေ ထွက်လာပြီးကတည်းက နိုင်ငံရေးဂယက်တုန့်ပြန်ချက်တွေ အတောမသတ်
      ထွက်လာခဲ့တယ်။ ဒါတွေကို လက်လှမ်းမီသမျှ လေ့လာရာက ခံစားချက်တွေ
      ဝင်လာလို့ ဒီဆောင်းပါးလေး ရေးဖြစ်တာပါ။'
      ရေးသားသူ: နိုင်တိ ကချင်ပြည်နယ်က မိုင်ဂျာယန်ဆိုတဲ့မြို့ကလေးမှာ ဂျူလိုင်လကုန်ပိုင်းလောက်က ကျင်းပခဲ့တဲ့
      “တိုင်းရင်းသား လက်နက်ကိုင်တော်လှန်ရေး အဖွဲ့အစည်းများ၏ မျက်နှာစုံညီအစည်းအဝေး” ရဲ့ ဆုံးဖြတ်ချက်တွေ
      ကြေငြာချက် တွေ ထွက်လာပြီးကတည်းက နိုင်ငံရေးဂယက်တုန့်ပြန်ချက်တွေ အတောမသတ် ထွက်လာခဲ့တယ်။ ဒါတွေကို
      လက်လှမ်းမီသမျှ လေ့လာရာက ခံစားချက်တွေ ဝင်လာလို့ ဒီဆောင်းပါးလေး ရေးဖြစ်တာပါ။"""
    )
  )    
  sampleTexts.append(
    Sample('shan', 'unicode', note='Shan data from http://shan.panglong.org/', 
      string=u"""
      ပၢင်ၵုမ်လူင် ပီႁူဝ်ပၢၵ်ႇ 21 ပၢင်လူင် ဢၼ်ၸတ်းႁဵတ်းတီႈၼေႇပျီႇတေႃႇ တီႈႁူင်းႁေႃး 
      MICC-II ၼၼ်ႉ ယူႇတီႈၸုမ်းဝႃႉႁၼ်ဝႃႈ ဢမ်ႇမီးလွင်ႈၽဵင်ႇပဵင်းၼႆသေ တူဝ်တႅၼ်းဝႃႉ 
      ၸိူဝ်းၶိုၼ်ႈႁွတ်ႈၶဝ်ႈႁူမ်ႈတင်းသဵင်ႈ ထွၼ်တူဝ်ဢွၵ်ႇပၢင်ၵုမ်ၵႂႃႇမိူဝ်ႈၼႆႉ ၽွင်းၵၢင်ဝၼ်း ။
      လွင်ႈဝိၶိၽီႊၻီႊယိူဝ်ႊၼၼ်ႉ လၢတ်ႈၼႄလၢႆးႁဵတ်း Account ၽႂ်မၼ်းလႄႈ လၢႆးတႅမ်ႈပွင်ႈ ၵႂၢမ်းတၢင်ႇၼိူဝ် 
      ဝိၶိၽီႊၻီႊယိူဝ်ႊ၊ လၢႆးသွၵ်ႈႁႃၶေႃႈမုလ်း ဢိၵ်ႇလၢႆးတၢင်ႇၶႅပ်းႁၢင်ႈ လႄႈ ၵူတ်းမၢႆ(မၢႆမီႈ) ၶႅပ်းႁၢင်ႈ 
      ၸိူဝ်းၼႆႉ။ မၼ်းၸဝ်ႈသပ်းလႅင်းၼႄဝႃႈ- ဝိၶိၽီႊၻီႊယိူဝ်ႊၼႆႉ ၵႂၢမ်းတႆးႁွင်ႉ ဝႃႈပပ်ႉသႅၼ်သမ်ႇ၊ 
      တႅၵ်ႈလႆႈမိူၼ်ၼင်ႇႁူင်းတူၺ်းလိၵ်ႈယႂ်ႇလူင်။ ၶႂ်ႈႁူႉၶေႃႈမုလ်းသင်ၵေႃႈ ၶဝ်ႈတူၺ်း။
      တေႃႈၼင်ႇၽူႈၵၢၼ်ႁဵၼ်းသုင်ၶဝ် ပိူဝ်ႈတႃႇဢဝ်ၸုမ်းၶူး"""
    )
  )
  sampleTexts.append(
    Sample('karen', 'unicode', note='Karen data converted from KNU font from http://www.kwekalu.net/', 
      string=u"""
      တၢ်ဂ့ၢ်လိာဘှီလိာအိၣ်ထီၣ်လၢဘီကထၣ်ထံတမၢၣ်တၢ်တိာကျဲၤကညီဒီကလုာစၢဖှိၣ်ကရၢကီၢ်ရ့ၣ်ချၢၣ်လွံၢ်ထူၣ်,
      သုးက့နီၣ်ဂံၢ်(၃)အပူၤတၢ်ရဲၣ်ကျဲၤ၀ဲလၢတၢ်ကဘှီထီၣ်၀ဲဒၣ်ဘီကထၣ်ထံတမၢၣ်တၢ်တိာကျဲၤအဂီၢ်,သူလ့ၤကူၣ်ပနံၣ်ဒီးကီၢ်ပယီၤတၢ်ထုးထီၣ်လီမ့ၣ်အူ
      ကိတိာ၀ဲၤကျိၤအိၣ်ဒီးတၢ်အၢၣ်လီၤတူၢ်လိာသကိးဆဲးစုပနီၣ်လၢတၢ်နၢ်ပၢၢ်အလံ်ာဃံးဃ်ာအပူၤလၢကဆဲးမၤသကိးတၢ်လၢထံတမၢၣ်တၢ်တိာကျဲၤအံၤဖ
      ဲလါဖ့ၤဘူၤအါရံၤ၁၈သီ,၂၀၁၆နံၣ်ဖဲကီၢ်ပယီၤ၀့ၢ်ခိၣ်န့ၣ်ပၠံၣ်ဒီၢ်န့ၣ်လီၤ.ကညီပၣ်တံၣ်၅ဖုဆၢတဲ်ာ၀ဲလၢကကဲက့ၤတဖုဃီက
      ညီပ်ာတံၣ်၅ဖုအၢၣ်လီၤတူၢ်လိာ၀ဲလၢအ၀ဲသ့ၣ်ကပ်ာဖှိၣ်ထီၣ်က့ၤသးတဖုဃီဖဲတၢ်မၤကညီပၣ်တံၣ်၅ဖုတၢ်အိၣ်ဖှိၣ်၃ဘျီတ
      ဘျီစးထီၣ်လါဖ့ၣ်ဘူၣ်အါရံၣ်၂၇တုၤ၂၈ဖဲ၀့ၢ်ဖၣ်အၣ်န့ၣ်လီၤ.ကီၢ်ပယီၤကလုာဒူၣ်ဖိအိၣ်ဒီးတၢ်မံမီၢ်အၢလၢထံတမၢၣ်အဃိ
      """
      )
  )
  sampleTexts.append(
    Sample('karen', 'zwebakin', note='Karen data', 
      string=u"""
Zwekabain font ကိုသံုးၿပီး ကရင္စာေတြ ႐ိုက္ဖို႔အတြက္ Kwekabaw Keyboard အသစ္
ထပ္ေရးလိုက္ပါတယ္။ အခု ကီးဘုတ္အသစ္က စေကာကရင္စာအတြက္ အဓိက ရည္ရြယ္တဲ့ 
အတြက္ စေကာကရင္စာမွာ အသံုးမ်ားတဲ့ KNU လက္ကြက္နဲ႔ အနီးစပ္ဆံုးတူေအာင္ 
လုပ္ထားပါတယ္။ ေဒါင္းလုတ္ယူဖို႔အတြက္ ဘယ္ဘက္ျခမ္းအေပၚေဒါင့္နားမွာ ေဖာင့္ေရာ 
ကီးဘုတ္ အသစ္၊ အေဟာင္း အားလံုး တင္ထားလိုက္ပါၿပီ။ ကီးဘုတ္နဲ႔အတူ လက္ကြက္ေတြလည္း 
တခါတည္း ထည့္ထားေပးပါတယ္။
ပိုးကရင္အတြက္ လက္ကြက္ေျပာင္းေပးဖို႔ လိုအပ္တယ္ဆိုရင္ စာေရးၿပီး ဆက္သြယ္ပါ။ 
က်ေနာ္တို႔ ညွိႏႈိုင္းၾကတာေပါ့။ ပိုးကရင္စာက ၂ မ်ိဳးျဖစ္ေနတဲ့အတြက္ သီးျခားကီးဘုတ္ 
လိုမယ္ထင္ပါတယ္။ အဲဒီအတြက္ စာ ၂ မ်ိဳးလံုးရဲ႕ ျဖစ္သင့္တဲ့ ကီးဘုတ္လက္ကြက္ နမူနာပို႔ေပးမယ္ – အႀကံျပဳ၀ိုင္း၀န္းၾကမယ္ဆိုရင္ အားလံုးကို ခင္မင္စြာ ႀကိဳဆိုပါတယ္ဗ်ား။
တခုေတာ့ ေျပာဖို႔ရွိပါတယ္။ အခု ဇြဲကပင္ေဖာင့္က ယူနီကုဒ္မဟုတ္ပါ။ ယူနီကုဒ္စတန္းဒတ္လည္း 
မ၀င္ပါ။ အင္တာနက္မွာ ျမင္ရဖို႔အတြက္ဘဲ ျဖစ္ပါေသးတယ္။
အခု ျမန္မာယူနီကုဒ္၊ ပုရပိုက္၊ ၀င္းယူနီအင္း၀ စတဲ့ ေဖာင့္ေတြကေတာ့
အထိ အဆင္ေျပသေလာက္ ျဖစ္ေနပါၿပီ။ (ျပႆနာ အနည္းအက်ဥ္းေတာ့ ရွိဦးမွာေပါ့ေလ။)
မွာ ျမန္မာယူနီကုဒ္ကို Support လုပ္ေပးထားပါၿပီ။ စာလံုးေတာ့ အရမ္းေသးေနတယ္ ေျပာတယ္။ က်ေနာ္ေတာ့ မေတြ႕ရေသးလို႔ ေအေသအခ်ာ မသိပါ။
အခုေနာက္ဆံုး ယူနီကုဒ္ Standard 6 စံသတ္မွတ္ခ်က္ ထြက္လာပါၿပီ။ ေအာက္မွာေပးထားတဲ့ 
ဖိုင္ ၂ ခုကို ေဒါင္းလုတ္ၿပီး သတ္မွတ္စာလံုးေတြကို ေလ့လာႏိုင္ပါတယ္။
ယူနီကုဒ္ ၆ သတ္မွတ္ခ်က္ဖိုင္ (၁)
ယူနီကုဒ္ ၆ သတ္မွတ္ခ်က္ဖိုင္ (၂)
အခု ယူနီကုဒ္ ၆ အထိမွာ က်ေနာ္တို႔ ကရင္စာအတြက္ အျပည့္အစံု မပါရွိေသးတာကို ေတြ႕ရပါတယ္။ 
ဥပမာ ေအာက္ထပ္ေရးတဲ့ စာလံုးအခ်ိဳ႕ – င ေအာက္ထပ္ကို က်ေနာ္တို႔အေနနဲ႔ ရ နဲ႔ ေရးပါတယ္။ 
အဲဒီအတြက္ unicode 105A မွာ နမူနာ ၾကည့္ၾကည့္ပါ။ က်ေနာ္တို႔ င ေအာက္ထပ္မွာက ရေကာက္ေလးဘဲ 
ပါပါတယ္။ အေပၚက ဘာမွ မပါပါဘူး။
ေနာက္တခုက ၀စၥေပါက္တလံုး- အဲဒါနဲ႔ တူတာက 108B မွာေတြ႕ရပါတယ္။ ဒါေပမယ့္ 
တကယ္တမ္းမွာဆိုရင္ေတာ့ သီးျခားသတ္မွတ္ဖို႔ လိုမယ္ထင္ပါတယ္။
"""
      )
  )

  sampleTexts.append(
    Sample('karen', 'unicode', note='Zwebakin converted to Unicode',
      string=u"""
ဟွေးကလုတ် ဒုက္ခသည်စခန်း မီးလောင်ကျွမ်းတဲ့ည ကယောင်ကတမ်းနဲ့ ဦးတည်ရာမဲ့ ပြေးလွှားကြရင်း
ကျုပ်သားမေးတဲ့စကားတခွန်း အြပါး ငါတို့ ဘယ်ကို သွားကြမလို့လဲဋ္ဋ တဲ့။
ကျုပ်ရဲ့ အမိုးနဲ့အပါး သူတို့လည်း ပြေးလွှားခဲ့ကြတယ်တဲ့။ လက်ပတ်ဖြူနဲ့ လက်ပတ်နီ ဘာမထီတဲ့စစ်ပွဲ
လူထုတွေသာ မြေဇာပင်ဖြစ် သူတို့ခေတ်က အဖြစ်အပျက် သွေးစက်တွေနဲ့ ချင်းချင်းနီ အတိတ်ဆီက ပန်းချီကား။
ကျုပ်ကျမှ တမူထူးခြား သူတပါးနိုင်ငံထဲ ရောက်နေတာတောင် နေ့ညမရှောင် ပြေးနေရတုန်းဆိုတော့ လူ့ဘ၀ထဲ 
ရောက်လာကြတဲ့ ကျုပ်ရဲ့သားတွေ
"""
    )
  )
  
  sampleTexts.append(
    Sample('karen?', 'unicode', note='Zwebakin from pahteepakaw.blogspot.com/2013/12/moe-zay-nyein-facebook.html',
      string=  u"""
  ၇။ ရန္ကုန္ၿမိဳ႕၊ ကမာရြတ္ၿမိဳ႕နယ္၊ အင္းယားလမ္း၊ အမွတ္ ၁၂ တြင္ ေအာင္ႏိုင္ဆုိသူထံမွ စိတ္ၾကြေဆးျပား 
  ၂၆၆၂ ျပား ဖမ္းဆီးရမိခဲ႔ပါသည္။ ေအာင္ႏုိင္သည္ အဆိုပါေဆးျပားမ်ားအား တန္႔ယန္းၿမိဳ႕နယ္၊ နမ္႔ေပါင္ရြာေန
   ညီစမ္း ဆိုသူထံမွ ဝယ္ယူခဲ႔ျခင္းျဖစ္ၿပီး ညီစမ္းမွာတန္႔ယန္းျမိဳ႕နယ္ မန္လယ္ရြာေန ဆန္႐ုန္း ဆိုသူထံမွ 
   သြားေရာက္ ဝယ္ယူျခင္း ျဖစ္ၿပီး ဆန္႐ုန္းအား ဖမ္းဆီးရမိေရးအတြက္ 
   ဆက္လက္ေထာက္လွမ္း စံုစမ္းလ်က္ ရွိပါသည္။
  """)
  )

  sampleTexts.append(
    Sample('karen', 'unicode', note='Converted from KNU',  
      string = u"""ပဒိၣ်တဖုအံၤကပတုာဃ်ာ၀ဲဃိၣ်လိာကျိထံတမၢၣ်လၢ
      ဃိၣ်လိာကျိအပူၤမ့ၢ်လၢအူသ့စ့ၣ်ပဒိၣ်အတၢ်ရဲၣ်တၢ်ကျဲၤလၢတၢ်ကဆဲးမၤသကိး၀ဲထံတမၢၣ်တၢ်တိာကျဲၤအံၤတၢ်ဒုးသ့ၣ်ညါ
      လီၢ်က၀ီၤထံဖိကီၢ်ဖိတအိၣ်၀ဲဂ့ၤဂ့ၤဘၣ်ဘၣ်ဘၣ်အဃိန့ၣ်လီၤ
      """
      )
  )

def computeTextModel(text):
  textModel = ngramModel('unknown lang', 'unknown encoding')
  for n in [3]:
    textModel.setN(n)
    textModel.clearModel()
    textModel.addFileToModel()
    textModel.addToModel(text)
    textModel.figureModelTotal()
    # textModel.saveModel('ZawgyiModel_%d_model.save' % textModel.ngramLength)
    textModel.printModelStats()
  return textModel


def showHistogram(allModels, i):
  thisModel = allModels[i]
  hist = thisModel.countHistogram()
  print 'Histogram for model %d, %s, %s, %d' % (i,
    thisModel.lang, thisModel.font, thisModel.ngramLength)
  for item in hist:
    print item


def main(argv=None):
  sampleTexts = []
  setSampleTexts(sampleTexts)
  print '%d sample texts found' % (len(sampleTexts))

  filenames = glob.glob('models/*.save')
  print 'Found %d saved models: %s' % (len(filenames), filenames)
  allModels = ngram.getSavedModels(filenames)

  # TODO: Consider pruning each model for ASCII.
  
  testSize = 5
  models3 = []
  for m in allModels:
    if m.ngramLength == testSize:
      models3.append(m)
  
  testModels = models3    
  index = 0
  for sample in sampleTexts:
    intext = sample.text
    note = sample.note
    print '\nSample %s, lang = %s, font=%s, note=%s' % (index, sample.lang, sample.font, note)
    
    textModel = computeTextModel(intext)
    
    try:
      print '  %s' % intext
    except UnicodeEncodeError:
      print '  ** Error in printing text.'
    print 
    (bestModel, bestRank) = ngram.tryMatch(testModels, intext, note)
    print 'Best match = %s, %s (%d), rank = %f' % (
      bestModel.lang, bestModel.font, bestModel.ngramLength, bestRank)
    print '  Expected lang = %s, font=%s' % (sample.lang, sample.font)
    index += 1  
  
  # Testing histogram for Zawgyi
  # showHistogram(allModels, 0)
  
if __name__ == "__main__":
    sys.exit(main(sys.argv))